## Library

In [1]:
import pandas as pd
import json
import re

## Operation

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [3]:
patten = '^s|^S'
def rutvik(num):
    match = re.search(patten,num)
    if bool(match):
        return True
    else:
        return False

# Home work

In [4]:
# Q1. How many male and female is onborded
male_count = sum(df['Sex']=='male')
female_count = sum(df['Sex']=='female')
print(f"The male count is {male_count} and female count is {female_count}")

The male count is 577 and female count is 314

In [5]:
# Q2.,Q3 survive and casuality count
survive = sum(df['Survived']==1)
casualty = sum(df['Survived']==0)
print(f"The count of survive is {survive},and casualty happend is {casualty}")

The count of survive is 342,and casualty happend is 549

In [6]:
df[df['Age']==max(df['Age'])]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

In [7]:
#Q4.  Name of person who is eldest one
name = df[df['Age']==max(df['Age'])]
# name = " ".join(str(name['Name']).split(' ')[4:-3])
name_of_person = name['Name'][630]
print(f"The name of person who has oldest one is : {name_of_person}")

The name of person who has oldest one is : Barkworth, Mr. Algernon Henry Wilson

In [8]:
#Q5. how many passenger do we have in first , second and third class 
first_class = len(df.groupby('Pclass').get_group(1))
second_class= len(df.groupby('Pclass').get_group(2))
third_class = len(df.groupby('Pclass').get_group(3))
print(f"Total number of people travel in first class is :  {first_class} , second class = {second_class} and third class is {third_class}")

Total number of people travel in first class is :  216 , second class = 184 and third class is 491

In [9]:
# Q6 how many person we have whose name starts with "s"
s_name = len(df[df['Name'].map(rutvik)])
print(f"The total number of people whose name start with s is {s_name}")

The total number of people whose name start with s is 86

In [10]:
# Q7  try to create a new column which is a summation  of "SibSp" and "parch"
df['new_part'] = df['SibSp'] + df['Parch']
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_part
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1

In [11]:
#Q8 count of people whose age is less than 25

count_age25 = len(df[df['Age']<25])

print(f"Their are {count_age25} people those age is less than 25")

Their are 278 people those age is less than 25

In [12]:
#Q9 count of people whose age is less than 40

count_age40 = len(df[df['Age']<40])

print(f"Their are {count_age40} people those age is less than 40")

Their are 551 people those age is less than 40

In [13]:
'2'.isnumeric()

True

In [14]:
def divide_str(string):
    char = ''
    num = ''
    try:
        for word in string[0]:
            if word.isnumeric():
                num+=word
            else:
                char+=word
        return char + ' '+ num
    except:
        return string
    
import string
# df['Name'] = df['Name'].str.rstrip(string.digits)

In [15]:
"""
From a cabin columns separate text and numeric value
"""
# df['Cabin'] = df['Cabin'].fillna(method = 'bfill')
df['Cabin_divide'] = df['Cabin'].str.split().map(divide_str)

In [16]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_part,Cabin_divide
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,C 85

# Home work 2

In [17]:
df = pd.read_csv('./data/bank.csv',sep = ';')
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

### Q1. How many campaign available in this dataset .

In [79]:
# 1 . how many campaign available in this dataset .
print(f"Their are \033[1m{len(df['campaign'].unique())}\033[0m campaign which name as {df['campaign'].unique()} ")

Their are 32 campaign which name as [ 1  4  2  5  3  6 18 10  9  7 12 14 13 24 11  8 29 32 16 22 15 30 25 21
 17 19 23 20 50 28 31 44]

### Q2. How many users do we have with housing and personal loan .

In [26]:
# Q.2 how many users do we have with housing and personal loan .

print(f"Their are {len(df[(df['housing']=='yes') & (df['loan']=='yes')])} which has Personal and housing loan")

Their are 406 which has Personal and housing loan

### Q3. how many person do we have whose age is 60+

In [112]:
print(f"Their are : {sum(df['age']>60)} those age is 60+ ")

Their are : 127 those age is 60+

In [46]:
def rutvik(num):
    if num=='no':
        return 0
    if num=='yes':
        return 1
df['out'] = df['y'].map(rutvik)

### Q4. In which month we have targeted most of the customer .

In [113]:
# 4 in which month we have tagerted most of the customer . 
month = df.groupby('month').sum()['out'].sort_values().index[-1]
print(f"In \033[1m{month.capitalize()}\033[0m month we got most of the customer")

In May month we got most of the customer

### Q5 . Which mode of call is giving you more result

In [110]:
df['contact'].unique()

array(['cellular', 'unknown', 'telephone'], dtype=object)

In [118]:
# 5 . which mode of call is giving you more result
dist = {'cellular':0,'unknown':0,'telephone':0}
arr = df[['contact']].values
for data in arr:
    dist[data[0]]+=1
    
Keymax = max(zip(dist.values(), dist.keys()))[1]
print(f"More result will get through \033[1m{Keymax}\033[0m Mode")

More result will get through cellular Mode

### Q6. How many enterpeures do we have in this list

In [123]:
print(f" Their are total \033[1m{len(df[df['job']=='entrepreneur'])}\033[0m Entrepreneur in list")

 Their are total 168 Entrepreneur in list

### Q7 . How many customers do we have with negative balance

In [126]:
bal = len(df[df['balance']<0])
print(f"Their are \033[1m{bal}\033[0m customers in list which balance is negative")

Their are 366 customers in list which balance is negative

### Q8. Prepare a group of data based on education level

<b>Unique list of eduction: </b><br>
<br>
'primary', 'secondary', 'tertiary', 'unknown'

In [135]:
primary_ed   = df[df['education']=='primary']
secondary_ed = df[df['education']=='secondary']
tertiary_ed  = df[df['education']=='tertiary']
unknown_ed   = df[df['education']=='unknown']

In [140]:
unknown_ed.head(2)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,out
20,38,management,divorced,unknown,no,0,yes,no,cellular,18,nov,96,2,-1,0,unknown,no,0
27,67,retired,married,unknown,no,696,no,no,telephone,17,aug,119,1,105,2,failure,no,0

In [139]:
tertiary_ed.head(2)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,out
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no,0
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no,0

In [137]:
secondary_ed.head(2)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,out
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,0
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no,0

In [136]:
primary_ed.head(2)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,out
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,0
9,43,services,married,primary,no,-88,yes,yes,cellular,17,apr,313,1,147,2,failure,no,0